# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Command-line fuzzy finder written in Go
brew "fzf"
# Node version management
brew "n"
# Free (GNU) replacement for the Pico text editor
brew "nano"
# Fast, highly customisable system info script
brew "neofetch"
# Cross-shell prompt for astronauts
brew "starship"
# General purpose fuzzy finder TUI
brew "television"
# Programmatically correct mistyped console commands
brew "thefuck"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Real-time type-ahead completion for Zsh
brew "zsh-autocomplete"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Write, edit, and chat about your code with AI
cask "cursor"
# Calendar software
cask "fantastical"
# Clipboard manager
cask "maccy"
# Control your tools with a few keystrokes
cask "raycast"
# Music streaming service
cask "spotify"
vscode "liviuschera.noctis"
